<h1>Корзина</h1>

<table>
  <tr>
    <td><p>Изображение</p></td>
    <td><p>Наименование</p></td>
    <td><p>Цена</p></td>
    <td><p>Колличество</p></td>
    <td><p>Стоимость</p></td>
  </tr>
<!---->
<?php
//  $product = getGoodsFromCart($link);
//  if($product):?>
<!--  <tr>-->
<!--    <td><p>--><?//= $product[''] ?><!--</p></td>-->
<!--    <td><p>Изображение</p></td>-->
<!--    <td><p>Наименование</p></td>-->
<!--    <td><p>Цена</p></td>-->
<!--    <td><p>Колличество</p></td>-->
<!--    <td><p>Стоимость</p></td>-->
<!--  </tr>-->
</table>